### Terraformの各結果
#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Terraform Validation `success`

<details><summary>Terraform Plan</summary>

```terraform
module.cloudwatch.data.aws_caller_identity.current: Reading...
data.aws_route53_zone.static_site_zone: Reading...
module.cloudwatch.data.aws_region.current: Reading...
module.cloudwatch.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.cloudwatch.data.aws_caller_identity.current: Read complete after 1s [id=657709068990]
data.aws_route53_zone.static_site_zone: Read complete after 1s [id=Z07363641C4FDUE38GQ9W]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.acm.aws_acm_certificate.static_site_certificate will be created
  + resource "aws_acm_certificate" "static_site_certificate" {
      + arn                       = (known after apply)
      + domain_name               = "african-samurai.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.african-samurai.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "african-samurai.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "www.african-samurai.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = "RSA_2048"
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + region                    = "us-east-1"
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.african-samurai.com",
          + "african-samurai.com",
          + "www.african-samurai.com",
        ]
      + tags                      = {
          + "Author"      = "Mitate Gengaku"
          + "Environment" = "Production"
          + "Name"        = "african-samurai.com"
          + "Owner"       = "Mitate Gengaku"
          + "Project"     = "S3 Static Site"
          + "Service"     = "Certificate Manager"
          + "Version"     = "1.0"
        }
      + tags_all                  = {
          + "Author"      = "Mitate Gengaku"
          + "Environment" = "Production"
          + "Name"        = "african-samurai.com"
          + "Owner"       = "Mitate Gengaku"
          + "Project"     = "S3 Static Site"
          + "Service"     = "Certificate Manager"
          + "Version"     = "1.0"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # module.acm.aws_acm_certificate_validation.static_site_certificate_validation will be created
  + resource "aws_acm_certificate_validation" "static_site_certificate_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + region                  = "us-east-1"
      + validation_record_fqdns = (known after apply)
    }

  # module.cloudfront.aws_cloudfront_distribution.static_site_distribution will be created
  + resource "aws_cloudfront_distribution" "static_site_distribution" {
      + aliases                         = [
          + "african-samurai.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = false
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Author"      = "Mitate Gengaku"
          + "Environment" = "Production"
          + "Name"        = "static-site-distribution"
          + "Owner"       = "Mitate Gengaku"
          + "Project"     = "S3 Static Site"
          + "Service"     = "CloudFront"
          + "Version"     = "1.0"
        }
      + tags_all                        = {
          + "Author"      = "Mitate Gengaku"
          + "Environment" = "Production"
          + "Name"        = "static-site-distribution"
          + "Owner"       = "Mitate Gengaku"
          + "Project"     = "S3 Static Site"
          + "Service"     = "CloudFront"
          + "Version"     = "1.0"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true
      + web_acl_id                      = (known after apply)

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 3153600
          + min_ttl                = 0
          + target_origin_id       = (known after apply)
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "https-only"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = (known after apply)
          + origin_access_control_id    = (known after apply)
          + origin_id                   = (known after apply)
          + response_completion_timeout = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + restrictions {
          + geo_restriction {
              + locations        = [
                  + "JP",
                ]
              + restriction_type = "whitelist"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (sensitive value)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.cloudfront.aws_cloudfront_origin_access_control.static_site_oac will be created
  + resource "aws_cloudfront_origin_access_control" "static_site_oac" {
      + arn                               = (known after apply)
      + description                       = "Managed by Terraform"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "static_site_oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.cloudwatch.data.aws_iam_policy_document.waf_log_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "waf_log_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)
      + version       = "2012-10-17"

      + statement {
          + actions   = [
              + "logs.CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + "arn:aws:logs:ap-northeast-1:657709068990:*",
                ]
              + variable = "aws:SourceArn"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "657709068990",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "delivery.logs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cloudwatch.aws_cloudwatch_log_group.waf_log_group will be created
  + resource "aws_cloudwatch_log_group" "waf_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "aws-waf-logs-static-site"
      + name_prefix       = (known after apply)
      + region            = "us-east-1"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Author"      = "Mitate Gengaku"
          + "Environment" = "Production"
          + "Name"        = "aws-waf-logs-static-site"
          + "Owner"       = "Mitate Gengaku"
          + "Project"     = "S3 Static Site"
          + "Service"     = "Cloud Watch"
          + "Version"     = "1.0"
        }
      + tags_all          = {
          + "Author"      = "Mitate Gengaku"
          + "Environment" = "Production"
          + "Name"        = "aws-waf-logs-static-site"
          + "Owner"       = "Mitate Gengaku"
          + "Project"     = "S3 Static Site"
          + "Service"     = "Cloud Watch"
          + "Version"     = "1.0"
        }
    }

  # module.cloudwatch.aws_cloudwatch_log_resource_policy.waf_log_policy will be created
  + resource "aws_cloudwatch_log_resource_policy" "waf_log_policy" {
      + id              = (known after apply)
      + policy_document = (known after apply)
      + policy_name     = "aws-waf-logs-static-site-policy"
      + region          = "ap-northeast-1"
    }

  # module.route53.aws_route53_record.static_site_cloudfront_record will be created
  + resource "aws_route53_record" "static_site_cloudfront_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "african-samurai.com"
      + type            = "A"
      + zone_id         = "Z07363641C4FDUE38GQ9W"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.route53.aws_route53_record.static_site_domain_record["*.african-samurai.com"] will be created
  + resource "aws_route53_record" "static_site_domain_record" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = (known after apply)
      + zone_id         = "Z07363641C4FDUE38GQ9W"
    }

  # module.route53.aws_route53_record.static_site_domain_record["african-samurai.com"] will be created
  + resource "aws_route53_record" "static_site_domain_record" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = (known after apply)
      + zone_id         = "Z07363641C4FDUE38GQ9W"
    }

  # module.route53.aws_route53_record.static_site_domain_record["www.african-samurai.com"] will be created
  + resource "aws_route53_record" "static_site_domain_record" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = (known after apply)
      + zone_id         = "Z07363641C4FDUE38GQ9W"
    }

  # module.s3.data.aws_iam_policy_document.allow_access_from_cloudfront will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_access_from_cloudfront" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)
      + policy_id     = "PolicyForCloudFrontPrivateContent"
      + version       = "2008-10-17"

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowCloudFrontServicePrincipal"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.s3.aws_s3_bucket.static_static_bucket will be created
  + resource "aws_s3_bucket" "static_static_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "jfeda156fda45fd6as456fd4a"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-northeast-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Author"      = "Mitate Gengaku"
          + "Environment" = "Production"
          + "Owner"       = "Mitate Gengaku"
          + "Project"     = "S3 Static Site"
          + "Service"     = "S3"
          + "Version"     = "1.0"
        }
      + tags_all                    = {
          + "Author"      = "Mitate Gengaku"
          + "Environment" = "Production"
          + "Owner"       = "Mitate Gengaku"
          + "Project"     = "S3 Static Site"
          + "Service"     = "S3"
          + "Version"     = "1.0"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3.aws_s3_bucket_ownership_controls.static_site_boc will be created
  + resource "aws_s3_bucket_ownership_controls" "static_site_boc" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-northeast-1"

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.s3.aws_s3_bucket_policy.static_site_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "static_site_bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "ap-northeast-1"
    }

  # module.waf.aws_wafv2_web_acl.cloudfront will be created
  + resource "aws_wafv2_web_acl" "cloudfront" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "WAF rules for static site with cloudfront"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "static-site-waf"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + scope                       = "CLOUDFRONT"
      + tags                        = {
          + "Author"      = "Mitate Gengaku"
          + "Environment" = "Production"
          + "Name"        = "static-site-waf"
          + "Owner"       = "Mitate Gengaku"
          + "Project"     = "S3 Static Site"
          + "Service"     = "WAF"
          + "Version"     = "1.0"
        }
      + tags_all                    = {
          + "Author"      = "Mitate Gengaku"
          + "Environment" = "Production"
          + "Name"        = "static-site-waf"
          + "Owner"       = "Mitate Gengaku"
          + "Project"     = "S3 Static Site"
          + "Service"     = "WAF"
          + "Version"     = "1.0"
        }

      + default_action {
          + block {
            }
        }

      + rule {
          + name     = "DisableOverseasIP"
          + priority = 1

          + action {
              + allow {
                }
            }

          + statement {
              + geo_match_statement {
                  + country_codes = [
                      + "JP",
                    ]
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "DisableOverseasIPMetric"
              + sampled_requests_enabled   = false
            }
        }
      + rule {
          + name     = "AWSRateBasedRule"
          + priority = 10

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 300
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSRateBasedRuleWAFMetric"
              + sampled_requests_enabled   = false
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "CloudFrontWAFMetric"
          + sampled_requests_enabled   = true
        }
    }

  # module.waf.aws_wafv2_web_acl_logging_configuration.waf_logging_config will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "waf_logging_config" {
      + id                      = (known after apply)
      + log_destination_configs = (known after apply)
      + region                  = "us-east-1"
      + resource_arn            = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>